## **Coding Exercise 18:** Filtering with one Condition

#### **The Problem:**

Filter df for the Sport "Volleyball" and save the subset (with all columns) in the variable volley (you may print volley as well).

#### **The Solution:**

In [ ]:
import pandas as pd

In [ ]:
summer = pd.read_csv('summer.csv')

In [ ]:
summer.head()

In [ ]:
volley_filter = summer["Sport"] == "Volleyball"
volley = summer.loc[volley_filter]
volley.head()

## **Coding Exercise 19:** Filtering with many Conditions

#### **The Problem:**

Filter df for all "Gold" Medal winners in the Sport "Volleyball" (all columns). Save the subset in the variable gold_volley (you may print gold_volley as well).

#### **The Solution:**

In [ ]:
import pandas as pd

In [ ]:
summer = pd.read_csv("summer.csv")

In [ ]:
summer.head()

In [ ]:
sport = summer['Sport'] == "Volleyball"
medal = summer['Medal'] == "Gold"

In [ ]:
gold_volley = summer.loc[sport & medal]
gold_volley.head()

## **Coding Exercise 20:** Advanced Filtering

#### **The Problem:**

Filter df for all Athletes from Italy (ITA), France (FRA), Spain (ESP), and the United States (USA) (all columns). Save the subset in the variable subset (you may print subset as well).

#### **The Solution:**

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv("summer.csv")

In [ ]:
countries = ['ITA', 'FRA', 'ESP', 'USA']

In [ ]:
subset = df.loc[df.Country.isin(countries)]

In [ ]:
subset

In [ ]:
subset.Country.unique()

## **Coding Exercise 21:** Search with any()

#### **The Problem:**

Check, if any Athlete from Argentina (ARG) won a Medal in the 1972 Edition.

(Print True or False).

#### **The Solution:**

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv("summer.csv")

In [ ]:
check = (df.Country == 'ARG').any()

In [ ]:
check

## **Coding Exercise 22:** Removing Columns

#### **The Problem:**

Remove the columns "embarked" and "deck" from df (you may print df as well).

#### **The Solution:**

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_csv("titanic.csv")

In [ ]:
df.drop(inplace = True, columns = ['embarked', 'deck'])

In [ ]:
df.head()

## **Coding Exercise 23:** Adding new Columns

#### **The Problem:**

Add the column "fare_EUR" with the ticket price in EUR. Divide each USD ticket price by 1.1 (assuming a EUR/USD FX rate of 1.1). You may print df with the additional column as well.

#### **The Solution:**

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("titanic.csv")

In [3]:
df['fare_EUR'] = df['fare'] / 1.1

In [4]:
df

,survived,pclass,sex,age,sibsp,parch,fare,embarked,deck,fare_EUR
0,0,3,male,22.0,1,0,7.2500,S,NaN,6.590909
1,1,1,female,38.0,1,0,71.2833,C,C,64.803000
2,1,3,female,26.0,0,0,7.9250,S,NaN,7.204545
3,1,1,female,35.0,1,0,53.1000,S,C,48.272727
4,0,3,male,35.0,0,0,8.0500,S,NaN,7.318182
...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,NaN,11.818182
887,1,1,female,19.0,0,0,30.0000,S,B,27.272727
888,0,3,female,NaN,1,2,23.4500,S,NaN,21.318182
889,1,1,male,26.0,0,0,30.0000,C,C,27.272727
890,0,3,male,32.0,0,0,7.7500,Q,NaN,7.045455

## **Coding Exercise 24:** Creating new DataFrames

#### **The Problem:**

Create and save the (exact) following DataFrame from scratch in the variable df (you may print df as well):

|     | Car | Job |
|-----|-----|-----|
| Mike| BMW |Pilot|
|Steve|Honda| Cook|
| Andy| Ford| Salesmen|

#### **The Solution:**

In [1]:
import pandas as pd

In [2]:
names = ['Mike', 'Steve', 'Andy']
cars = ['BMW', 'Honda', 'Ford']
jobs = ['Pilot', 'Cook', 'Salesman']

In [3]:
dic = {
    'Name': names,
    'Car': cars,
    'Job': jobs
}

In [4]:
df = pd.DataFrame(data = dic)

In [5]:
df.set_index('Name', inplace = True)

In [6]:
df

         Car       Job
Name
Mike     BMW     Pilot
Steve  Honda      Cook
Andy    Ford  Salesman